R2129487/hermes-xiaoxi/xiaoxi-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# PSRAM - N16R8 用 octal 模式
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash - QIO 模式，释放 GPIO26-27
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
